# Дан список чисел, который может содержать до 100000 чисел. Определите,
# сколько в нём встречается различных чисел.
#
# Формат ввода
# Вводится список целых чисел. Все числа списка находятся на одной строке.
#
# Формат вывода
# Выведите ответ на задачу.

# numbers = input().split()
# numbers = list(map(int, numbers))
# unique_numbers = []
# for el in numbers:
#     if el not in unique_numbers:
#         unique_numbers.append(el)
#
# print(len(unique_numbers))


# numbers = input().split()
# numbers = list(map(int, numbers))
# unique_numbers = set(numbers)
#
# print(len(unique_numbers))


# print(len(set(map(int, input().split()))))



